benchmarks/results/20260308_235901/04_chat_history.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmarks/history_load.js
        output: json (benchmarks/results/20260308_235901/04_chat_history.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 1 looping VUs for 1m0s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-03-09T00:02:06+05:30" level=info msg="[setup] Ready — conversationId=10" source=console

running (0m01.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 1/1 VUs  0m00.6s/1m00.0s

running (0m02.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [   3% ] 1/1 VUs  0m01.6s/1m00.0s

running (0m03.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [   4% ] 1/1 VUs  0m02.6s/1m00.0s

running (0m04.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [   6% ] 1/1 VUs  0m03.6s/1m00.0s

running (0m05.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [   8% ] 1/1 VUs  0m04.6s/1m00.0s

running (0m06.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
default   [   9% ] 1/1 VUs  0m05.6s/1m00.0s

running (0m07.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
default   [  11% ] 1/1 VUs  0m06.6s/1m00.0s

running (0m08.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
default   [  13% ] 1/1 VUs  0m07.6s/1m00.0s

running (0m09.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
default   [  14% ] 1/1 VUs  0m08.6s/1m00.0s

running (0m10.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
default   [  16% ] 1/1 VUs  0m09.6s/1m00.0s

running (0m11.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
default   [  18% ] 1/1 VUs  0m10.6s/1m00.0s

running (0m12.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
default   [  19% ] 1/1 VUs  0m11.6s/1m00.0s

running (0m13.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
default   [  21% ] 1/1 VUs  0m12.6s/1m00.0s

running (0m14.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
default   [  23% ] 1/1 VUs  0m13.6s/1m00.0s

running (0m15.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
default   [  24% ] 1/1 VUs  0m14.6s/1m00.0s

running (0m16.0s), 1/1 VUs, 30 complete and 0 interrupted iterations
default   [  26% ] 1/1 VUs  0m15.6s/1m00.0s

running (0m17.0s), 1/1 VUs, 32 complete and 0 interrupted iterations
default   [  28% ] 1/1 VUs  0m16.6s/1m00.0s

running (0m18.0s), 1/1 VUs, 34 complete and 0 interrupted iterations
default   [  29% ] 1/1 VUs  0m17.6s/1m00.0s

running (0m19.0s), 1/1 VUs, 36 complete and 0 interrupted iterations
default   [  31% ] 1/1 VUs  0m18.6s/1m00.0s

running (0m20.0s), 1/1 VUs, 38 complete and 0 interrupted iterations
default   [  33% ] 1/1 VUs  0m19.6s/1m00.0s

running (0m21.0s), 1/1 VUs, 40 complete and 0 interrupted iterations
default   [  34% ] 1/1 VUs  0m20.6s/1m00.0s

running (0m22.0s), 1/1 VUs, 42 complete and 0 interrupted iterations
default   [  36% ] 1/1 VUs  0m21.6s/1m00.0s

running (0m23.0s), 1/1 VUs, 44 complete and 0 interrupted iterations
default   [  38% ] 1/1 VUs  0m22.6s/1m00.0s

running (0m24.0s), 1/1 VUs, 46 complete and 0 interrupted iterations
default   [  39% ] 1/1 VUs  0m23.6s/1m00.0s

running (0m25.0s), 1/1 VUs, 48 complete and 0 interrupted iterations
default   [  41% ] 1/1 VUs  0m24.6s/1m00.0s

running (0m26.0s), 1/1 VUs, 50 complete and 0 interrupted iterations
default   [  43% ] 1/1 VUs  0m25.6s/1m00.0s

running (0m27.0s), 1/1 VUs, 52 complete and 0 interrupted iterations
default   [  44% ] 1/1 VUs  0m26.6s/1m00.0s

running (0m28.0s), 1/1 VUs, 54 complete and 0 interrupted iterations
default   [  46% ] 1/1 VUs  0m27.6s/1m00.0s

running (0m29.0s), 1/1 VUs, 56 complete and 0 interrupted iterations
default   [  48% ] 1/1 VUs  0m28.6s/1m00.0s

running (0m30.0s), 1/1 VUs, 58 complete and 0 interrupted iterations
default   [  49% ] 1/1 VUs  0m29.6s/1m00.0s

running (0m31.0s), 1/1 VUs, 60 complete and 0 interrupted iterations
default   [  51% ] 1/1 VUs  0m30.6s/1m00.0s

running (0m32.0s), 1/1 VUs, 62 complete and 0 interrupted iterations
default   [  53% ] 1/1 VUs  0m31.6s/1m00.0s

running (0m33.0s), 1/1 VUs, 64 complete and 0 interrupted iterations
default   [  54% ] 1/1 VUs  0m32.6s/1m00.0s

running (0m34.0s), 1/1 VUs, 66 complete and 0 interrupted iterations
default   [  56% ] 1/1 VUs  0m33.6s/1m00.0s

running (0m35.0s), 1/1 VUs, 68 complete and 0 interrupted iterations
default   [  58% ] 1/1 VUs  0m34.6s/1m00.0s

running (0m36.0s), 1/1 VUs, 70 complete and 0 interrupted iterations
default   [  59% ] 1/1 VUs  0m35.6s/1m00.0s

running (0m37.0s), 1/1 VUs, 72 complete and 0 interrupted iterations
default   [  61% ] 1/1 VUs  0m36.6s/1m00.0s

running (0m38.0s), 1/1 VUs, 74 complete and 0 interrupted iterations
default   [  63% ] 1/1 VUs  0m37.6s/1m00.0s

running (0m39.0s), 1/1 VUs, 76 complete and 0 interrupted iterations
default   [  64% ] 1/1 VUs  0m38.6s/1m00.0s

running (0m40.0s), 1/1 VUs, 78 complete and 0 interrupted iterations
default   [  66% ] 1/1 VUs  0m39.6s/1m00.0s

running (0m41.0s), 1/1 VUs, 80 complete and 0 interrupted iterations
default   [  68% ] 1/1 VUs  0m40.6s/1m00.0s

running (0m42.0s), 1/1 VUs, 82 complete and 0 interrupted iterations
default   [  69% ] 1/1 VUs  0m41.6s/1m00.0s

running (0m43.0s), 1/1 VUs, 84 complete and 0 interrupted iterations
default   [  71% ] 1/1 VUs  0m42.6s/1m00.0s

running (0m44.0s), 1/1 VUs, 86 complete and 0 interrupted iterations
default   [  73% ] 1/1 VUs  0m43.6s/1m00.0s

running (0m45.0s), 1/1 VUs, 88 complete and 0 interrupted iterations
default   [  74% ] 1/1 VUs  0m44.6s/1m00.0s

running (0m46.0s), 1/1 VUs, 90 complete and 0 interrupted iterations
default   [  76% ] 1/1 VUs  0m45.6s/1m00.0s

running (0m47.0s), 1/1 VUs, 92 complete and 0 interrupted iterations
default   [  78% ] 1/1 VUs  0m46.6s/1m00.0s

running (0m48.0s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  79% ] 1/1 VUs  0m47.6s/1m00.0s

running (0m49.0s), 1/1 VUs, 96 complete and 0 interrupted iterations
default   [  81% ] 1/1 VUs  0m48.6s/1m00.0s

running (0m50.0s), 1/1 VUs, 98 complete and 0 interrupted iterations
default   [  83% ] 1/1 VUs  0m49.6s/1m00.0s

running (0m51.0s), 1/1 VUs, 100 complete and 0 interrupted iterations
default   [  84% ] 1/1 VUs  0m50.6s/1m00.0s

running (0m52.0s), 1/1 VUs, 102 complete and 0 interrupted iterations
default   [  86% ] 1/1 VUs  0m51.6s/1m00.0s

running (0m53.0s), 1/1 VUs, 104 complete and 0 interrupted iterations
default   [  88% ] 1/1 VUs  0m52.6s/1m00.0s

running (0m54.0s), 1/1 VUs, 106 complete and 0 interrupted iterations
default   [  89% ] 1/1 VUs  0m53.6s/1m00.0s

running (0m55.0s), 1/1 VUs, 108 complete and 0 interrupted iterations
default   [  91% ] 1/1 VUs  0m54.6s/1m00.0s

running (0m56.0s), 1/1 VUs, 110 complete and 0 interrupted iterations
default   [  93% ] 1/1 VUs  0m55.6s/1m00.0s

running (0m57.0s), 1/1 VUs, 112 complete and 0 interrupted iterations
default   [  94% ] 1/1 VUs  0m56.6s/1m00.0s

running (0m58.0s), 1/1 VUs, 114 complete and 0 interrupted iterations
default   [  96% ] 1/1 VUs  0m57.6s/1m00.0s

running (0m59.0s), 1/1 VUs, 116 complete and 0 interrupted iterations
default   [  98% ] 1/1 VUs  0m58.6s/1m00.0s

running (1m00.0s), 1/1 VUs, 118 complete and 0 interrupted iterations
default   [  99% ] 1/1 VUs  0m59.6s/1m00.0s

     ✓ GET .../messages → 200
     ✓ GET .../messages → has messages
     ✓ GET .../messages → p95 <1000ms

     █ setup

       ✓ setup: login 200
       ✓ setup: token present
       ✓ setup: conversation 201
       ✓ setup: conversation id present

     checks.........................: 100.00% 361 out of 361
     data_received..................: 39 kB   650 B/s
     data_sent......................: 35 kB   570 B/s
     http_req_blocked...............: avg=11.84µs  min=5.78µs  med=7.42µs   max=271.85µs p(50)=7.42µs   p(95)=12.85µs  p(99)=171.84µs
     http_req_connecting............: avg=2.7µs    min=0s      med=0s       max=178.17µs p(50)=0s       p(95)=0s       p(99)=120.21µs
     http_req_duration..............: avg=7.15ms   min=2.89ms  med=3.88ms   max=383.21ms p(50)=3.88ms   p(95)=5.18ms   p(99)=11.54ms 
       { expected_response:true }...: avg=7.19ms   min=3.18ms  med=3.88ms   max=383.21ms p(50)=3.88ms   p(95)=5.19ms   p(99)=11.62ms 
     ✓ { name:chat_history }........: avg=3.98ms   min=3.18ms  med=3.88ms   max=5.6ms    p(50)=3.88ms   p(95)=5.03ms   p(99)=5.48ms  
     http_req_failed................: 0.81%   1 out of 122
     ✓ { name:chat_history }........: 0.00%   0 out of 119
     http_req_receiving.............: avg=92.71µs  min=51.04µs med=80.86µs  max=509.12µs p(50)=80.86µs  p(95)=133.92µs p(99)=238.13µs
     http_req_sending...............: avg=29.15µs  min=20.02µs med=27.62µs  max=107.83µs p(50)=27.62µs  p(95)=41.72µs  p(99)=45.66µs 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(50)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=7.03ms   min=2.69ms  med=3.76ms   max=383.06ms p(50)=3.76ms   p(95)=5.06ms   p(99)=11.43ms 
     http_reqs......................: 122     2.017051/s
     iteration_duration.............: avg=504.85ms min=503.6ms med=504.84ms max=506.33ms p(50)=504.84ms p(95)=506.11ms p(99)=506.29ms
     iterations.....................: 119     1.967451/s
     vus............................: 1       min=1          max=1
     vus_max........................: 1       min=1          max=1


running (1m00.5s), 0/1 VUs, 119 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/1 VUs  1m0s